<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class ProductsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('products')->delete();
        
        \DB::table('products')->insert(array (
            0 => 
            array (
                'id' => 5,
            'name' => 'بيزك (نص)',
                'price' => 75,
                'colors' => 'ابيض,اسود,رصاصي,بيج,بني,بيبي بلو,بيبي بينك,فوشيا,مخطط بني,مخطط بيج,مخطط اسود,مخطط أبيض,مخطط بينك,مخطط موف,مخطط أخضر,مخطط لبني',
                'sizes' => '-',
                'created_at' => '2025-05-14 21:59:08',
                'updated_at' => '2025-07-04 15:03:30',
                'cost_price' => '0.00',
            ),
            1 => 
            array (
                'id' => 6,
            'name' => 'بيزك (كت)',
                'price' => 75,
                'colors' => 'ابيض,اسود,رصاصي,بيج,بني,بيبي بلو,بيبي بينك,فوشيا',
                'sizes' => '-',
                'created_at' => '2025-05-21 13:05:07',
                'updated_at' => '2025-06-17 11:24:03',
                'cost_price' => '0.00',
            ),
            2 => 
            array (
                'id' => 16,
                'name' => 'بيزك ديربي H',
                'price' => 300,
            'colors' => '(نص كم) ابيض مخطط موف, (نص كم)  اسود مخطط ابيض, (نص كم) ابيض مخطط بينك, (نص كم) ابيض مخطط بيج, اسود, ابيض, بيبي بينك, بيج (نص فقط), رصاصي, بيبي بلو, بيج نوع البيزك: كت, رصاصي نوع البيزك: كت, ابيض نوع البيزك: كت, اسود نوع البيزك: كت, بيج, فوشيا, (نص)مخطط ابيض, (نص)مخطط بني, (نص)مخطط اسود, (نص)مخطط بيج, (نص)مخطط بينك, (نص)مخطط ليموني, (نص)مخطط موف, (نص)مخطط اسود نوع البيزك: نص, (نص)مخطط بيج نوع البيزك: نص, اسود نوع البيزك: نص, بيبي بينك نوع البيزك: نص, رصاصي نوع البيزك: نص, ابيض نوع البيزك: نص, (نص)مخطط بينك نوع البيزك: كت, بيبي بينك نوع البيزك: كت, (نص)مخطط ابيض نوع البيزك: كت, بيج نوع البيزك: نص, (نص)مخطط ابيض نوع البيزك: نص, (نص)مخطط بيج نوع البيزك: كت, فوشيا نوع البيزك: كت, (نص)مخطط اسود نوع البيزك: كت',
                'sizes' => 'نص, كت',
                'created_at' => '2025-06-29 19:55:02',
                'updated_at' => '2025-07-16 17:45:21',
                'cost_price' => '0.00',
            ),
            3 => 
            array (
                'id' => 18,
                'name' => 'منتجات أخرى',
                'price' => 250,
                'colors' => 'حسب ما تم اختياره',
                'sizes' => '-',
                'created_at' => '2025-07-19 22:35:19',
                'updated_at' => '2025-07-19 22:36:10',
                'cost_price' => '0.00',
            ),
        ));
        
        
    }
}